app/views/devise/registrations/edit.html.erb


        <% @applies = Apply.where(:user_id => current_user.id ) %>
---
SELECT "applies".* FROM "applies" WHERE "applies"."user_id" = ?  [["user_id", 1]]