app/views/admin/currentapply.html.erb

SELECT "applies".* FROM "applies" WHERE "applies"."post_id" = ? AND "applies"."success" = ?  [["post_id", 1], ["success", "f"]]
---
            <%= bootstrap_form_for(@apply, url: {action: "confirm_apply"}, method: "post") do |f| %>
                <% @post.applies.where(:success => false).each do |a| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "applies" WHERE "applies"."user_id" = ?  [["user_id", 2]]
---
                    <div class="col-sm-1"><!-- <h5>클래스명</h5> --></div>
                    <div class="col-sm-3"><h5><%unless a.user_id.nil? %><%= a.user.name %>(<%= a.user.applies.count%>)<%else%><%= a.users[0]%>(비회원)<% end %></h5></div>