app/views/home/intro.html.erb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
---
            <div class="col-sm-6 control-container-left">
                <p><%= Admin.find(1).intro_text.html_safe %></p>