app/controllers/admin_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
---
  def oneday
    if current_user.admin==false
      redirect_to "/"
    end

  	@admin=Admin.find(1)

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "admins" SET "oneday" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["oneday", nil], ["updated_at", "2015-11-29 09:21:21.671969"], ["id", 1]]
---
  def update_oneday
    if current_user.admin==false
      redirect_to "/"
    end


  	admin = Admin.find(1)

  	admin.update(oneday: params[:admin][:oneday])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def currentapply

    @apply = Apply.new
    @post = Post.find(params[:id].to_i)

SELECT  "applies".* FROM "applies" WHERE "applies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "applies" SET "success" = ?, "updated_at" = ? WHERE "applies"."id" = ?  [["success", "t"], ["updated_at", "2015-12-01 08:48:53.451986"], ["id", 1]]
---
  def confirm_apply

    unless params[:confirm].nil?
      params[:confirm].each do |c|
        @apply = Apply.find(c.to_i)

        @apply.success = true
        @apply.save

SELECT  "applies".* FROM "applies" WHERE "applies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "applies" SET "success" = ?, "updated_at" = ? WHERE "applies"."id" = ?  [["success", "f"], ["updated_at", "2015-12-01 08:48:56.131960"], ["id", 1]]
---
  def cancel_apply

    unless params[:cancel].nil?
      params[:cancel].each do |c|
        @apply = Apply.find(c.to_i)

        @apply.success = false
        @apply.save