app/controllers/home_controller.rb

  def intro
  	@admin = Admin.find(1)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def calendar

  	@posts = Post.all
---
SELECT "posts".* FROM "posts"