app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at ASC LIMIT 1
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
---
	  def index
  	 	@class_name = Hash[1 => "성인 정규 클래스", 2 => "성인 원데이 클래스", 3 => "요리책방 꼬르륵", 4 => "주니어 클래스", 5 => "PRIVATE CLASS", 6 => "정 In The Garden"]

	    @posts = Post.order("created_at DESC")

	    @admin = Admin.find(1)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
---
	  def show
  	  	@class_name = Hash[1 => "성인 정규 클래스", 2 => "성인 원데이 클래스", 3 => "요리책방 꼬르륵", 4 => "주니어 클래스", 5 => "PRIVATE CLASS", 6 => "정 In The Garden"]


	    @post = Post.find(params[:id])

INSERT INTO "posts" ("date", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "11/03/201511/04/201511/11/201511/18/2015"], ["title", "테스트"], ["body", "<p>안녕하세요.</p>\r\n"], ["created_at", "2015-11-29 07:36:11.482428"], ["updated_at", "2015-11-29 07:36:11.482428"]]
---
	  def create
	    @post = Post.new(post_params)

	    date = params[:post][:date]

	    unless date.nil?
	    	@post.date = nil
	    	arr_date = date.split(', ')
	    end

	    @post.date=arr_date

	    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
	  def destroy

	  	p=Post.find(params[:id].to_i)
	  	p.destroy